@edwardmedia , here is the full output for the 3 terraform calls...
```
$/home/isdrrm/gcp/mosaic/robm-cloud-func-test/sysdev: terraform init -upgrade

Upgrading modules...
- global in ../global
- global.base in ../global/modules/base
- us-central1 in us-central1
- us-central1.regional in ../regional
- us-central1.regional.base in ../regional/modules/base

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/google...
- Installing hashicorp/google v3.85.0...
- Installed hashicorp/google v3.85.0 (self-signed, key ID 34365D9472D7468F)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
```
```
$/home/isdrrm/gcp/mosaic/robm-cloud-func-test/sysdev: terraform plan

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.global.module.base.google_cloudbuild_trigger.robm_cloud_func_code_build_trigger will be created
  + resource "google_cloudbuild_trigger" "robm_cloud_func_code_build_trigger" {
      + create_time = (known after apply)
      + description = "testing cloud function sandbox"
      + filename    = "cloudbuild.yaml"
      + id          = (known after apply)
      + name        = "robm-cloud-func-test-trigger"
      + project     = "ivr-divasp-sysdev-dev-01"
      + trigger_id  = (known after apply)

      + github {
          + name  = "robm-cloud-func-test"
          + owner = "rrmestl-cx"

          + pull_request {
              + branch = "main$"
            }
        }
    }

  # module.global.module.base.google_logging_project_sink.robm_cloud_func_test_sink will be created
  + resource "google_logging_project_sink" "robm_cloud_func_test_sink" {
      + description            = "sink to handle RobM Cloud Func tests"
      + destination            = "pubsub.googleapis.com/projects/ivr-divasp-sysdev-dev-01/topics/robm-cloud-func-test-topic"
      + filter                 = "resource.type = gce_instance AND (textPayload =~ \"robm-cloud-func-test:\" OR textPayload =~ \"robm-cloud-func-test\\[.*?\\]: ERROR\" OR jsonPayload.message =~ \"robm-cloud-func-test:\" OR jsonPayload.message =~ \"robm-cloud-func-test\\[.*?\\]: ERROR\" OR jsonPayload.syslog_tag = \"robm-cloud-func-test\")"
      + id                     = (known after apply)
      + name                   = "robm-cloud-func-test-sink"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.global.module.base.google_pubsub_subscription.robm_cloud_func_test_subs will be created
  + resource "google_pubsub_subscription" "robm_cloud_func_test_subs" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + labels                     = {
          + "state" = "active"
        }
      + message_retention_duration = "604800s"
      + name                       = "robm-cloud-func-test-sub"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + retain_acked_messages      = false
      + topic                      = "robm-cloud-func-test-topic"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.global.module.base.google_pubsub_topic.robm_cloud_func_test_topic will be created
  + resource "google_pubsub_topic" "robm_cloud_func_test_topic" {
      + id      = (known after apply)
      + labels  = {
          + "state" = "active"
        }
      + name    = "robm-cloud-func-test-topic"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.global.module.base.google_service_account_iam_member.robm_cloud_func_test_pubsub_role will be created
  + resource "google_service_account_iam_member" "robm_cloud_func_test_pubsub_role" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "group:iva-alerting-sysdev@mosaic-cx.com"
      + role               = "roles/pubsub.publisher"
      + service_account_id = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```
```
$/home/isdrrm/gcp/mosaic/robm-cloud-func-test/sysdev: terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.global.module.base.google_cloudbuild_trigger.robm_cloud_func_code_build_trigger will be created
  + resource "google_cloudbuild_trigger" "robm_cloud_func_code_build_trigger" {
      + create_time = (known after apply)
      + description = "testing cloud function sandbox"
      + filename    = "cloudbuild.yaml"
      + id          = (known after apply)
      + name        = "robm-cloud-func-test-trigger"
      + project     = "ivr-divasp-sysdev-dev-01"
      + trigger_id  = (known after apply)

      + github {
          + name  = "robm-cloud-func-test"
          + owner = "rrmestl-cx"

          + pull_request {
              + branch = "main$"
            }
        }
    }

  # module.global.module.base.google_logging_project_sink.robm_cloud_func_test_sink will be created
  + resource "google_logging_project_sink" "robm_cloud_func_test_sink" {
      + description            = "sink to handle RobM Cloud Func tests"
      + destination            = "pubsub.googleapis.com/projects/ivr-divasp-sysdev-dev-01/topics/robm-cloud-func-test-topic"
      + filter                 = "resource.type = gce_instance AND (textPayload =~ \"robm-cloud-func-test:\" OR textPayload =~ \"robm-cloud-func-test\\[.*?\\]: ERROR\" OR jsonPayload.message =~ \"robm-cloud-func-test:\" OR jsonPayload.message =~ \"robm-cloud-func-test\\[.*?\\]: ERROR\" OR jsonPayload.syslog_tag = \"robm-cloud-func-test\")"
      + id                     = (known after apply)
      + name                   = "robm-cloud-func-test-sink"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)

      + bigquery_options {
          + use_partitioned_tables = (known after apply)
        }
    }

  # module.global.module.base.google_pubsub_subscription.robm_cloud_func_test_subs will be created
  + resource "google_pubsub_subscription" "robm_cloud_func_test_subs" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + labels                     = {
          + "state" = "active"
        }
      + message_retention_duration = "604800s"
      + name                       = "robm-cloud-func-test-sub"
      + path                       = (known after apply)
      + project                    = (known after apply)
      + retain_acked_messages      = false
      + topic                      = "robm-cloud-func-test-topic"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.global.module.base.google_pubsub_topic.robm_cloud_func_test_topic will be created
  + resource "google_pubsub_topic" "robm_cloud_func_test_topic" {
      + id      = (known after apply)
      + labels  = {
          + "state" = "active"
        }
      + name    = "robm-cloud-func-test-topic"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # module.global.module.base.google_service_account_iam_member.robm_cloud_func_test_pubsub_role will be created
  + resource "google_service_account_iam_member" "robm_cloud_func_test_pubsub_role" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "group:iva-alerting-sysdev@mosaic-cx.com"
      + role               = "roles/pubsub.publisher"
      + service_account_id = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.global.module.base.google_pubsub_topic.robm_cloud_func_test_topic: Creating...
module.global.module.base.google_cloudbuild_trigger.robm_cloud_func_code_build_trigger: Creating...
module.global.module.base.google_cloudbuild_trigger.robm_cloud_func_code_build_trigger: Creation complete after 0s [id=projects/ivr-divasp-sysdev-dev-01/triggers/17ceb106-626a-4d68-8736-6a7964334bef]
module.global.module.base.google_pubsub_topic.robm_cloud_func_test_topic: Creation complete after 1s [id=projects/ivr-divasp-sysdev-dev-01/topics/robm-cloud-func-test-topic]
module.global.module.base.google_logging_project_sink.robm_cloud_func_test_sink: Creating...
module.global.module.base.google_pubsub_subscription.robm_cloud_func_test_subs: Creating...
module.global.module.base.google_logging_project_sink.robm_cloud_func_test_sink: Creation complete after 1s [id=projects/ivr-divasp-sysdev-dev-01/sinks/robm-cloud-func-test-sink]
module.global.module.base.google_service_account_iam_member.robm_cloud_func_test_pubsub_role: Creating...
module.global.module.base.google_pubsub_subscription.robm_cloud_func_test_subs: Creation complete after 2s [id=projects/ivr-divasp-sysdev-dev-01/subscriptions/robm-cloud-func-test-sub]

Error: Error retrieving IAM policy for service account 'projects/ivr-divasp-sysdev-dev-01/serviceAccounts/p197201731551-214505@gcp-sa-logging.iam.gserviceaccount.com': googleapi: Error 404: Service account projects/ivr-divasp-sysdev-dev-01/serviceAccounts/p197201731551-214505@gcp-sa-logging.iam.gserviceaccount.com does not exist., notFound

  on ../global/modules/base/test_resource.tf line 82, in resource "google_service_account_iam_member" "robm_cloud_func_test_pubsub_role":
  82: resource "google_service_account_iam_member" "robm_cloud_func_test_pubsub_role" {

```
Let me know if you need me to lookup anything in the GCP console and provide feedback evidence for you.

Thanks,
Rob